#+TITLE: git-share a git repository resolver

#+name: project-description-short
#+header: :results value drawer
#+begin_src elisp :exports results :eval no-export
"A git repository registration service and resolver."
#+end_src

#+RESULTS: project-description-short
:results:
A git repository registration service and resolver.
:end:

*** test
#+begin_src bash :results drawer
curl -X POST http://localhost:4242/git/e6cf3a391686a0b49171b9b195da88e81125bb1e?remote=https://github.com/tgbugs/git-share.git
#+end_src

#+RESULTS:
:results:
Register: git:e6cf3a391686a0b49171b9b195da88e81125bb1e -> https://github.com/tgbugs/git-share.git
:end:

#+begin_src bash :results drawer
curl -X GET http://localhost:4242/git/e6cf3a391686a0b49171b9b195da88e81125bb1e
#+end_src

#+RESULTS:
:results:
Id: git:e6cf3a391686a0b49171b9b195da88e81125bb1e -> ((git@github.com:tgbugs/git-share.git)
                                                     (https://github.com/tgbugs/git-share.git))
:end:

#+begin_src bash
time for i in {0..9999}; do echo $i; done | \
xargs -P15 -r -n 1 -- curl -X GET http://localhost:4242/git/e6cf3a391686a0b49171b9b195da88e81125bb1e -H
#+end_src

|  time | avg       |
|-------+-----------|
|   6.8 | 6.8072857 |
|   6.7 | 1469.0143 |
| 6.542 |           |
| 7.323 |           |
| 7.045 | slad      |
| 6.306 |           |
| 6.935 | slad      |
#+TBLFM: @2$2=vmean(@2$1..@>$1)
#+TBLFM: @3$2=(10000 / @2$2)

Run this in your repl if you are going to run these directly.
Might be able to unify =with-connection= and =query= for both
repl and server, aka swank and hunchentoot. As long as we don't
have multiple databases that we need to query within a single
namespace this should be ok.

#+name: connect-toplevel
#+begin_src lisp :noweb yes
(defparameter *db-connection*
  (postmodern:connect-toplevel
   "<<db-name>>"
   "<<user-name>>"
   "gsu123"
   "localhost"))
#+end_src

#+begin_src elisp :noweb yes :results drawer :wrap src lisp
(pp '
 <<connect-toplevel>>)
#+end_src

#+RESULTS:
#+begin_src lisp
(defparameter *db-connection*
  (postmodern:connect-toplevel "git_share_test" "git-share-user" "gsu123" "localhost"))
#+end_src

#+begin_src lisp
(postmodern:query (:select '* :from 'first_commits))
#+end_src

#+begin_src lisp
(postmodern:query "INSERT INTO first_commits (first_commit, git_remote)
                    VALUES ('6d96945e85d4e949215910f13f3e620495b5e165',
                            'https://github.com/tgbugs/pyontutils.git')")
#+end_src

